/*******************************************************************************\

disk driver interface module

part of suntar ©1991-95 Sauro & Gabriele Speranza

This program is public domain, feel free to use it or part of it for anything

\*******************************************************************************/

/* #define PROVE */



#include "PB_sync.h"
#include "antiglue.h"

#ifndef THINK_C_5
#include	<DiskDvr.h>
#include	<DeviceMgr.h>
#else
#include    <Disks.h>
#include    <files.h>
#define ioRefNum ioCRefNum
#endif

#include "windows.h"
#include "suntar.h"
#include <string.h>


#define SINGLE_SIDED	2
#define TWO_SIDED	3
#define SUPERDRIVE	4


extern short n_superdrives,last_drive,preferred_drive;
extern short drive_type[max_drive];
extern Boolean disco_espulso;

short Sony_driver;

unsigned char first_sector[512];	/* used to verify that the disk was not replaced */
long last_disk_operation;

OSErr get_format(DrvSts*,char*);
Boolean is_msdos_disk(short);
void verify_sectors(sector_t,char *,short);
static OSErr my_DriveStatus(CntrlParam *parblk);
Boolean check_changed_disk(void);
short get_driver_name(short,unsigned char *);


short FindDriverByName( void *);
Boolean volume_in_place(short);
void test_tape_EOF(void);
void reposition_tape(void);

enum os_type riconosci_disco_mac(sector_2)
unsigned char sector_2[512];
{
/* sector 2 contains the essential informations about the disk in both MFS and HFS */
enum os_type i;

if( *(short*) sector_2== 0xD2D7 )
	i=mac_MFS;
else if( *(short*) sector_2== 0x4244)
	i=mac_HFS;
else
	return unknown_os;

if( sector_2[36]<=27 /*lunghezza del nome*/ &&
 	   *(short*)&sector_2[12]>0 /* numero di files nel disco */)
	return i;
else
 	return unknown_os;	/* two possible 16 bit values means 1 probability
 						out of 32768 to recognize as Mac disk a non-Mac one,
 						testing some other fields decreases it... */
}


static Boolean is_msdos_disk(drive_n)
short drive_n;
{
/* ms-dos does not define a field containing some fixed value, but some
fields are much larger than the small numbers they should hold, hence there is much
redundancy, if all those fields have reasonable values, and at least some are not
zero, then it must be an ms-dos disk
Attention ! It uses the value of sectors_on_floppy which must be set to the correct
value for the disk
*/

struct bootsector {		/* from mtools, msdos.h */
/*0*/	unsigned char jump[3];		/* Jump to boot code */
/*3*/	unsigned char banner[8];	/* OEM name & version */
/*11*/	unsigned char secsiz[2];	/* Bytes per sector hopefully 512 */
/*13*/	unsigned char clsiz;		/* Cluster size in sectors */
/*14*/	unsigned char nrsvsect[2];	/* Number of reserved (boot) sectors */
/*16*/	unsigned char nfat;			/* Number of FAT tables hopefully 2 */
/*17*/	unsigned char dirents[2];	/* Number of directory slots */
/*19*/	unsigned char psect[2];		/* Total sectors on disk */
/*21*/	unsigned char descr;		/* Media descriptor=first byte of FAT */
/*22*/	unsigned char fatlen[2];	/* Sectors in FAT */
/*24*/	unsigned char nsect[2];		/* Sectors/track */
/*26*/	unsigned char nheads[2];	/* Heads */
/*28*/	unsigned char nhs[4];		/* number of hidden sectors: 2 bytes for
									normal disks, 4 bytes for >32 Mbytes  */
/*32*/  unsigned char bigsect[4];	/* big total sectors, big disks only */
/*36*/	unsigned char junk[476];	/* who cares? */
};


unsigned char buffer[512];
short i;
long n_s;
extern Boolean old_msdos;
static unsigned char offs[]= {11,12,13,15,16,18,23,25,26,27};
static unsigned char min[]=  {0, 2, 0, 0, 1, 0, 0, 0, 1, 0};
static unsigned char limit[]={0, 2, 32,0, 2, 2, 0, 0, 2, 0};

read_one_sector(0,buffer,drive_n);
if(err_code) return false;

old_msdos=false;
for(i=0;i<sizeof(offs);i++){
	if((unsigned char)buffer[offs[i]]>limit[i] ||
	   (unsigned char)buffer[offs[i]]<min[i]){
		if(i<7) return false;
		old_msdos=true;	/* those fields don't exist in disks formatted by a very 
						old version of ms-dos */
		}
	}

lowbyte(i)= buffer[19];
highbyte(i)= buffer[20];
n_s=i;

if(i==0){	/* it's 0 for disks formatted by a very old MS-DOS, but also for
			partitions >32 Mbytes in DOS 5 */
	register char *p=&buffer[36], *q=(char*)&n_s;
	*q++=*--p;		/* as usual, revert the byte order */
	*q++=*--p;
	*q++=*--p;
	*q++=*--p;
	}
else{
